//Завдання 5
//
//        Використовуючи IntelliJ IDEA, створіть клас Main. Перевірте, чи можна створити змінні з такими іменами:
//
//        uberflu?, _Identifier, \u006fIdentifier, &myVar, myVariab1le
public class Main {
    public static void main(String[] arg){
        int uberflu?; //Нельзя использовать  спец символы и зарезервированные слова в названиях
        int _Identifier; //Плохая практика начинать имя переменной с_
        int \u006fIdentifier;//Нельзя использовать  спец символы и зарезервированные слова в названиях
        int &myVar;//Нельзя использовать спец символы и зарезервированные слова в названиях
        int myVariab1le; //тут почти все правильно, не понятно зачем там 1, похоже опечатка


    }
}
