//Використовуючи IntelliJ IDEA, створіть клас Interval.

//        Напишіть програму визначення: чи потрапляє вказане користувачем число від 0 до 100 до числового проміжку [0 – 14] [15 – 35] [36 – 50][50 – 100].
//        Якщо так, то вкажіть, який саме проміжок.
//        Якщо користувач вказує число, яке не входить до жодного з наявних числових проміжків, то виведіть відповідне повідомлення.

import java.util.Scanner;

public class Interval {
    public static void main(String[] arg) {
        Scanner inpInt = new Scanner(System.in);
        int num;
        String str; //строка для вывода результата, принято решение в зависимости от типа решения использовать конкатенацию, и вывести, результат
        // если нам нужно дальше использовать результат, тогда нужно использовать переменную в неё записать номер отрезка и потом вывести результат
        System.out.println("Enter 0 to 100");
        if (inpInt.hasNextInt()) {// Изучил метод проверки на целое число, если истинно, значит введено целое число
            //так можно проверить, не только целое число, но и другие типы
            num = inpInt.nextInt();// забираем, то, что мы ввели
            if (num >= 0 && num < 15)// первый сегмент [0 – 14]
                str = num + " in 1 segment [0 – 14]";
            else if (num >= 15 && num <= 35)// второй сегмент [15 – 35]
                str = num + " in 2 segment [15 – 35]";
            else if (num >= 36 && num < 50) // третий сегмент [36 – 50]
                str = num + " in 3 segment [36 – 50]";// тут у нас в условии число 50 входит в 2 промежутка, поэтому выделим его в отдельное условие
            else if (num > 50 && num <= 100)// четвертый сегмент [50 – 100]
                str = num + " in 4 segment [50 – 100]";
            else if (num == 50) // тут отдельно условие на 50, потому что по условию оно в 2-х отрезках
                str = num + " in 3-4 segment [36 – 50] [50 – 100]";
            else str = "no segment";
            System.out.println(str); //выводим результат
        } else
            System.out.println("You input not integer value");
    }
}
