public class Main {
    public static void main(String[] args) {
        double r = 0;
        int x = 10,y = 12,z = 3;
        x += y - x++ * z;  //=>x=x+y-x++*z=>x+y=10+12=22=>x*z=10*3=30=>x+1=>22-30=-8
        //при инкременте і++ , вначале выполняется операция, потом добавляется 1
        System.out.println("x += y - x++ * z=>x=x+y-x++*z=>x+y(10+12)=22=>x*z(10*3)=30=>x+1=>22-30=-8");
        System.out.println("x="+x+" y="+y+" z="+z);//x=-8 y=12 z=3


        x = 10;
        y = 12;
        z = 3;
        z = --x - y * 5;  //=>x-1=10-1=9=>y*5=12*5=60=>9-60=-51
        //при (пре)декременте --і , вначале отнимается 1 выполняется операция.
        System.out.println("z = --x - y * 5=>x-1=10-1=9=>y*5=12*5=60=>9-60=-51");
        System.out.println("x="+x+" y="+y+" z="+z);//z=-51 x=9 z=3


        x = 10;
        y = 12;
        z = 3;
        y /= x + 5 % z;  //=>y=y/(x+5%z)=>5%z=5%3=2(ост.от деления)=>x+5%z=10+2=12=>y/12=12/12=1
        System.out.println("y /= x + 5 % z=>y=y/(x+5%z)=>5%z=5%3=2(ост.от деления)=>x+5%z=10+2=12=>y/12=12/12=1");
        System.out.println("x="+x+" y="+y+" z="+z);//x=10 y=1 z=3


        x = 10;
        y = 12;
        z = 3;
        z = x++ + y * 5;  //=>10+y*5=>x+1=>10+12*5=10+60=70
        //при инкременте і++ , вначале выполняется операция, потом добавляется 1
        System.out.println("z = x++ + y * 5=>10+y*5=>x+1=>10+12*5=10+60=70");
        System.out.println("x="+x+" y="+y+" z="+z);//x=11 y=12 z=70


        x = 10;
        y = 12;
        z = 3;
        x = y - x++ * z;  //=>y-x*z=10*3=30=>x+1=>y-30=12-30=-18
        //при инкременте і++ , вначале выполняется операция, потом добавляется 1
        System.out.println("z = x++ + y * 5=>10+y*5=>x+1=>10+12*5=10+60=70");
        System.out.println("x="+x+" y="+y+" z="+z);//x=-18 y=12 z=3
    }
}