
//Завдання 3

        //Є N клієнтів, яким компанія-виробник має доставити товар.
// Скільки є можливих маршрутів доставлення товару з урахуванням того, що товар доставлятиме одна машина?
// Використовуючи IntelliJ IDEA, створіть клас Delivery.
// Напишіть програму, яка розраховуватиме та виводитиме на екран кількість можливих варіантів доставлення товару.
// Для розв'язку задачі, використовуйте факторіал N!, що розраховується рекурсією. Поясніть,
// чому не рекомендується використовувати рекурсію для розрахунку факторіала. Вкажіть слабкі місця цього підходу.
import java.util.Scanner;

public class Delivery {
    static int delivery(int client) {
        if (client <= 1)
            return 1;
        else return client * delivery(client - 1);
    }
    static int inputInt() {
        Scanner inp = new Scanner(System.in);
        while (!inp.hasNextInt()) {
            System.out.printf("Введено не ціле значення !!!%nСпробуйте ще раз%n");
            inp.next();
        }
        return inp.nextInt();
    }

    public static void main(String[] arg) {
        int inpDev;
        System.out.println("Введить кількість клієтів:");
        inpDev=inputInt();
        System.out.println("Кількість варіантів доставки - "+delivery(inpDev));
    }
}
//В первую очередь рекурсия штампует при каждой итерации новый метод, это влечет за собой выделение памяти.
//Так же каждая итерация это ресурсы компьютера
// так же при факториалах получаются большие числа, что ведет к заполнению памяти методами.
// по-этому более эффективно использовать цикл, ведь факториал не влечет за собой сложных алгоритмов.

